# -*- coding:utf-8 -*-
import requests
import re

# 注意用try……except……语句
def getHTMLText(url):
    try:
        r = requests.get(url, timeout = 30)
        r.raise_for_status() # 如果是200，表示返回的内容正确；如果不是200，会产生HttpError异常
        r.encoding = r.apparent_encoding # 将对文本中分析的编码来替换整体的编码
        return r.text
    except:
        return ""

def parsePage(ilt, html):
    try:
        plt = re.findall(r'"view_price":"[\d.]*"', html)
        # plt = re.findall(r'\"view_price\"\:\"[\d\.]*\"', html) # 匹配键值对——"view_price":"[\d.]*"
        tlt = re.findall(r'"raw_title":".*?"', html)
        # tlt = re.findall(r'\"raw_title\"\:\".*?\"', html) # *?表示前一个字符0或无限次扩展，最小匹配（只取到最后一个”为止的内容，这样就约束了匹配的内容就是商品本身的名字）
        for i in range(len(plt)):
            price = eval(plt[i].split(':')[1]) # 去掉view_price字段，只取价格部分。eval函数用来执行字符串表达式，并返回表达式的值（相当于将外面的双引号去掉）。这里string.split(pattern)不是正则表达式re.split(pattern, string)，是将字符串分割，[1]是获得键值对的后面部分。
            title = eval(tlt[i].split(':')[1])
            ilt.append([price, title])
    except:
        print("")

def printGoodsList(ilt):
    tplt = '{:4}\t{:8}\t{:16}' # 定义输出格式的模板
    print(tplt.format('序号', '价格', '商品名称'))
    count = 0
    for g in ilt:
        count += 1
        print(tplt.format(count, g[0], g[1]))

def main():
    goods = '书包'
    depth = 2 # 爬取的深度，即有多个网页时决定爬几个网页
    start_url = 'https://s.taobao.com/search?q=' + goods
    infoList = []
    for i in range(depth):
        try:
            url = start_url + '&s=' + str(44*i)
            html = getHTMLText(url)
            parsePage(infoList, html)
        except:
            continue
    printGoodsList(infoList)

main()

# 输出结果
# 序号  	价格      	商品名称
#    1	119.00  	瑞戈瑞士军刀中学生书包爆款双肩包男1111
#    2	39.90   	迪卡侬双肩包男女学生书包健身包运动新款校园20升休闲 KIPSTA
#    3	59.90   	迪卡侬旗舰店官网新款双肩背包男女户外登山包学生休闲书包QUBP
#    4	129.00  	南翻盖双肩包女2018春季新款欧美时尚纯色学院风小书包 女背包潮
#    5	219.00  	莱夫书包女韩版时尚双肩包小帆布百搭尼龙背包2017新款潮2018女包
#    6	249.00  	莱夫帆布小背包女韩版潮2017新款个性百搭双肩包女士2018旅行胸包
#    7	399.00  	正品瑞典北极狐/fjallraven双肩包kanken背包classic书包mini男女
#    8	220.50  	aza双肩包女包新款韩版2018百搭旅行包学生书包背包男女小清新潮
#    9	49.00   	书包小学生 1-2-3-6年级男女生减负双肩儿童书包男孩防水护脊背包
#   10	99.00   	米熙休闲运动背包双肩包女书包中学生男时尚潮流大容量旅游旅行包
#   11	149.00  	小米双肩包简约休闲多功能书包男女笔记本电脑包时尚潮流旅行背包
#   12	49.00   	小学生书包6-12周岁 女儿童双肩包 3-5年级女童背包 1-3年级女孩
#   13	59.00   	双肩包女韩版2017新款潮时尚个性百搭2018牛津布帆布小书包背包女
#   14	69.00   	双肩包女韩版2018时尚个性百搭迷你小包包2017新款潮书包女士背包
#   15	158.00  	专柜正品JanSport杰斯伯经典双肩背包男女同款学生书包T501纯色
#   16	169.00  	Polo双肩包男 时尚潮流青年书包商务简约皮电脑大学生男士背包
#   17	129.00  	七匹狼商务双肩包男 书包中学生女双肩电脑包 旅行男士背包大容量
#   18	99.00   	uek幼儿园书包男女孩宝宝公主1-3-6岁可爱卡通防走失双肩儿童背包
#   19	79.00   	艾奔 双肩包男背包女韩版潮 商务男士电脑包高中学生书包休闲旅行
#   20	168.00  	裂狼时尚潮流皮男双肩包休闲男包旅行包大容量男士背包学生书包潮
#   21	208.00  	anello双肩包女日本代购乐天背包手提包日韩学生书包alleno妈咪包
#   22	69.00   	双肩包女韩版2017新款百搭学院风初中学生书包女大学高中校园背包
#   23	208.00  	日本正品anello双肩包代购男女帆布乐天背包学生防盗书包运动潮牌
#   24	208.00  	【香港直邮】anello双肩包男女离家出走包学生书包旅行包休闲背包
#   25	139.00  	施维茨男士双肩包大容量背包女商务电脑旅行包休闲潮高中学生书包
#   26	139.00  	赫登尔双肩包男士潮流背包男韩版旅行包时尚休闲学生书包电脑包潮
#   27	158.00  	双肩包男商务防盗笔记本电脑包15.6寸书包男士大容量背包时尚潮流
#   28	69.00   	双肩包女韩版时尚百搭个性休闲包包2017新款潮pu软皮书包2018背包
#   29	119.00  	巴朗新款商务旅行双肩包时尚潮流大学生书包15.6寸电脑包男士背包
#   30	119.00  	韩国kk树书包小学生男1-3-4-6年级儿童书包女6-12周岁双肩包护脊
#   31	119.00  	瑞戈瑞士军刀旅行包旅游双肩包瑞士中学生书包女15.6寸电脑背包男
#   32	129.00  	瑞士军刀双肩包男瑞士电脑旅行背包女大容量高中大学初中学生书包
#   33	59.00   	背包男韩版双肩包时尚潮流休闲商务电脑包大容量旅行高中学生书包
#   34	179.00  	Bodachel北美潮牌限量双肩包 男士时尚潮流休闲复古背包电脑书包
#   35	29.90   	韩版夜光男士休闲旅行包背包双肩包女初中生中学生书包男时尚潮流
#   36	89.00   	书包小学生男1-3-4-6年级儿童减负护脊女6-12周岁初中学生双肩包
#   37	149.00  	双肩包男士时尚潮流背包韩版个性书包男大学生运动休闲电脑旅行包
#   38	139.00  	七匹狼背包男商务双肩包男士旅行休闲时尚潮流电脑青年书包大容量
#   39	59.00   	迪士尼书包小学生男女1-3-4-6年级米奇减负背包儿童书包8-10-12岁
#   40	79.00   	双肩包男士背包时尚潮流初中高中学生书包大学生女商务旅行电脑包
#   41	125.00  	瑞士军刀双肩包瑞士中学生书包女休闲男士商务旅行大容量电脑背包
#   42	129.00  	牛津布双肩包女韩版2018新款百搭帆布大学生尼龙书包时尚旅行背包
#   43	65.00   	2018新款双肩包女牛津布韩版潮百搭背包时尚休闲书包女包包旅行包
#   44	59.00   	男背包旅游休闲商务电脑韩版时尚潮流大高中学生书包旅行双肩包
#   45	69.00   	2018新款双肩包女潮流时尚休闲女包pu软皮女士背包学生校园书包小
#   46	189.00  	商务双肩包男17寸电脑包大容量青年短途出差旅行包多功能防盗背包
#   47	208.00  	anello双肩包女日本乐天书包防水背包防盗大容量离家出走包alleno
#   48	225.00  	日本anello双肩包女妈咪防盗乐天学生背包书包离家出走包alleno男
#   49	129.00  	七匹狼男背包初高中校园学生大容量书包男士商务电脑旅行包双肩包
#   50	225.00  	日本anello双肩包女防盗乐天背包书包妈咪包离家出走包alleno男
#   51	203.00  	日本anello双肩包女防盗书包乐天背包妈咪包女离家出走包alleno男
#   52	119.00  	七匹狼双肩包男 新款商务男士旅行背包女休闲大容量电脑学生书包
#   53	199.00  	皓顿背包双肩包男士休闲旅行多功能大容量时尚潮流书包商务包男
#   54	69.00   	休闲双肩包韩版简约旅行背包电脑初中高中学生校园书包男时尚潮流
#   55	69.00   	双肩包女2018新款韩版潮流百搭休闲包包学生校园书包女牛津布背包
#   56	129.00  	帆布格子双肩包女 韩版潮2018新款大容量休闲女包 牛津布两用背包
#   57	78.00   	迪士尼书包小学生女童1-3-6年级公主6-12岁女孩儿童休闲双肩背包
#   58	59.00   	防盗双肩包女2018新款韩版大容量尼龙百搭书包牛津布帆布背包2017
#   59	69.90   	2018新款包包牛津布双肩包女韩版潮百搭时尚背包ulzzang学生书包
#   60	149.00  	双肩包男个性休闲韩版男士背包电脑旅行包学生书包男运动时尚潮流
#   61	119.00  	双肩背包男休闲多功能男士商务15.6寸电脑包 大容量 简约出差
#   62	58.80   	商务背包男士双肩包韩版潮流旅行包休闲女学生书包简约时尚电脑包
#   63	299.00  	BOPAI博牌电脑背包男户外旅行休闲双肩包商务防盗充电多功能男包
#   64	129.00  	七匹狼双肩包男 韩版女休闲潮包 学生书包电脑包旅行包双肩背包男
#   65	179.00  	莱夫女士双肩包韩版潮2018新款帆布简约时尚个性牛津布迷你小背包
#   66	108.00  	大容量商务旅行包瑞士军刀双肩包瑞士背包男士高中学生书包电脑包
#   67	29.90   	书包小学生1-2-3-6年级男女生 护脊耐磨轻防水儿童双肩包6-12周岁
#   68	58.00   	美国队长书包小学生男1-3-6年级轻便耐磨儿童书包一年级双肩背包
#   69	78.00   	迪士尼书包小学生1-3-5男童四五六女双肩4-6年级儿童背包米奇书包
#   70	59.00   	小学生书包男童1-3-4年级双肩男孩6-12周岁轻便防水男生儿童书包
#   71	59.00   	牛津布双肩包女韩版2018新款学生书包帆布2017百搭潮小背包大容量
#   72	59.00   	牛津布双肩包女包2018新款书包韩版原宿ulzzang 高中学生小包背包
#   73	119.00  	新款大容量男士双肩包旅行多功能防盗15.6寸电脑包书包商务背包男
#   74	118.00  	布言新款双肩包男皮包时尚潮流背包韩版百搭旅行包英伦大学生书包
#   75	129.00  	七匹狼商务双肩包男士背包女韩版中学生书包休闲男包旅行包电脑包
#   76	59.00   	背包双肩包男时尚潮流青年商务旅行大容量男士电脑包休闲学生书包
#   77	128.00  	绝地求生周边三级背包PUBG吃鸡游戏同款帆布防水迷彩电脑书包双肩
#   78	107.00  	老人头双肩包男韩版电脑包潮流女背包休闲大容量旅行包学生书包男
#   79	69.90   	牛津布双肩包女2018新款韩版潮原宿ulzzang学生书包帆布校园背包
#   80	118.00  	瑞士军刀双肩包男士背包大容量休闲商务电脑包韩版高中书包旅行包